hucsif/smart_surveillance/esp32-cam/main/app_httpd.c
    extern const unsigned char index_ov3660_html_gz_start[] asm("_binary_index_ov3660_html_gz_start");
    extern const unsigned char index_ov3660_html_gz_end[] asm("_binary_index_ov3660_html_gz_end");
    size_t index_ov3660_html_gz_len = index_ov3660_html_gz_end - index_ov3660_html_gz_start;

    extern const unsigned char index_ov5640_html_gz_start[] asm("_binary_index_ov5640_html_gz_start");
    extern const unsigned char index_ov5640_html_gz_end[] asm("_binary_index_ov5640_html_gz_end");
    size_t index_ov5640_html_gz_len = index_ov5640_html_gz_end - index_ov5640_html_gz_start;

    httpd_resp_set_type(req, "text/html");
    httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
    sensor_t *s = esp_camera_sensor_get();
    if (s != NULL) {
        if (s->id.PID == OV3660_PID) {
            return httpd_resp_send(req, (const char *)index_ov3660_html_gz_start, index_ov3660_html_gz_len);
        } else if (s->id.PID == OV5640_PID) {
            return httpd_resp_send(req, (const char *)index_ov5640_html_gz_start, index_ov5640_html_gz_len);
        } else {
            return httpd_resp_send(req, (const char *)index_ov2640_html_gz_start, index_ov2640_html_gz_len);
        }
    } else {
        ESP_LOGE(TAG, "Camera sensor not found");
        return httpd_resp_send_500(req);
    }
}

static esp_err_t monitor_handler(httpd_req_t *req)
{
    extern const unsigned char monitor_html_gz_start[] asm("_binary_monitor_html_gz_start");
    extern const unsigned char monitor_html_gz_end[] asm("_binary_monitor_html_gz_end");
    size_t monitor_html_gz_len = monitor_html_gz_end - monitor_html_gz_start;
    httpd_resp_set_type(req, "text/html");
    httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
    return httpd_resp_send(req, (const char *)monitor_html_gz_start, monitor_html_gz_len);
}

static esp_err_t ai_capture_handler(httpd_req_t *req)
{
    sensor_t *s = esp_camera_sensor_get();
    if (!s) {
        ESP_LOGE(TAG, "Camera sensor not found");
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }
    
    // 获取图像（使用当前设置，不做任何修改）
    camera_fb_t *fb = esp_camera_fb_get();
    
    if (!fb) {
        ESP_LOGE(TAG, "Camera capture failed");
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }

    // 设置响应头
    httpd_resp_set_type(req, "image/jpeg");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_set_hdr(req, "Cache-Control", "no-cache");
    
    // 添加分辨率信息（方便调试）
    char dim[32];
    snprintf(dim, sizeof(dim), "%dx%d", fb->width, fb->height);
    httpd_resp_set_hdr(req, "X-Resolution", dim);
    
    ESP_LOGI(TAG, "AI capture: %dx%d, %d bytes", fb->width, fb->height, fb->len);
    
    // 发送图像
    esp_err_t res = httpd_resp_send(req, (const char *)fb->buf, fb->len);
    
    esp_camera_fb_return(fb);
    return res;
}

//ESP32摄像头HTTP服务器的初始化代码，实现了Web界面控制摄像头功能
void app_httpd_main()
{
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.max_uri_handlers = 16;

    httpd_uri_t index_uri = {
        .uri = "/",
        .method = HTTP_GET,
        .handler = index_handler,
        .user_ctx = NULL};

    httpd_uri_t status_uri = {
        .uri = "/status",
        .method = HTTP_GET,
        .handler = status_handler,
        .user_ctx = NULL};

    httpd_uri_t cmd_uri = {
        .uri = "/control",
        .method = HTTP_GET,
        .handler = cmd_handler,
        .user_ctx = NULL};

    //获取单帧图像    
    httpd_uri_t capture_uri = {
        .uri = "/capture",
        .method = HTTP_GET,
        .handler = capture_handler,
        .user_ctx = NULL};
    
    //MJPEG视频流
    httpd_uri_t stream_uri = {
        .uri = "/stream",
        .method = HTTP_GET,
        .handler = stream_handler,
        .user_ctx = NULL};
    
    //BMP格式图像捕获
    httpd_uri_t bmp_uri = {
        .uri = "/bmp",
        .method = HTTP_GET,
        .handler = bmp_handler,
        .user_ctx = NULL};

    // 调整XCLK时钟频率
    httpd_uri_t xclk_uri = {
        .uri = "/xclk",
        .method = HTTP_GET,
        .handler = xclk_handler,
        .user_ctx = NULL};

    // 设置摄像头寄存器值    
    httpd_uri_t reg_uri = {
        .uri = "/reg",
        .method = HTTP_GET,
        .handler = reg_handler,
        .user_ctx = NULL};

    // 读取摄像头寄存器值    
    httpd_uri_t greg_uri = {
        .uri = "/greg",
        .method = HTTP_GET,
        .handler = greg_handler,
        .user_ctx = NULL};

    // 调整PLL时钟配置    
    httpd_uri_t pll_uri = {
        .uri = "/pll",
        .method = HTTP_GET,
        .handler = pll_handler,
        .user_ctx = NULL};

    // 调整图像分辨率   
    httpd_uri_t win_uri = {
        .uri = "/resolution",
        .method = HTTP_GET,
        .handler = win_handler,
        .user_ctx = NULL};
    
    // mDNS服务控制（使设备可通过域名访问）    
    httpd_uri_t mdns_uri = {
        .uri = "/mdns",
        .method = HTTP_GET,
        .handler = mdns_handler,
        .user_ctx = NULL};

    // 系统监控信息   
    httpd_uri_t monitor_uri = {
        .uri = "/monitor",
        .method = HTTP_GET,
        .handler = monitor_handler,
        .user_ctx = NULL};

    // 为esp32s3获取帧图像提供专用接口
    httpd_uri_t ai_capture_uri = {
        .uri = "/ai_capture",   
        .method = HTTP_GET,
        .handler = ai_capture_handler,
        .user_ctx = NULL};

    /*
        初始化滚动平均滤波器（Rolling Average Filter）
        窗口大小：20帧
        作用：平滑图像参数，减少噪声
    */    
    ra_filter_init(&ra_filter, 20);

//人脸检测配置    
#if CONFIG_ESP_FACE_DETECT_ENABLED

    mtmn_config.type = FAST;              // 使用快速检测模式
    mtmn_config.min_face = 80;            // 最小检测人脸大小：80x80像素
    mtmn_config.pyramid = 0.707;          // 图像金字塔缩放因子
    mtmn_config.pyramid_times = 4;        // 金字塔层数
    
    //三阶段检测阈值配置
    // P-Net（Proposal Network）参数
    mtmn_config.p_threshold.score = 0.6;            // 得分阈值
    mtmn_config.p_threshold.nms = 0.7;              // 非极大值抑制阈值
    mtmn_config.p_threshold.candidate_number = 20;  // 候选框数量

    // R-Net（Refine Network）参数
    mtmn_config.r_threshold.score = 0.7;
    mtmn_config.r_threshold.nms = 0.7;
    mtmn_config.r_threshold.candidate_number = 10;

